WELCOME_MESSAGE = "Добро пожаловать в Репорт Бота"

GET_PHONE_NUMBER = "Отправьте свой номер телефона, для регистрации в нашем боте"
WRONG_PHONE_NUMBER_FORMAT = "Вы неккоректно ввели номер телефона"
SUCCESSFUL_PHONE_REGISTRATION = "Вы успешно зарегестрировались"

MAIN_MENU = "Главное меню нашего бота"

REPORT_TEXT = "Пожалуйста, подробно опишите вашу пробему текстом"

REPORT_PHOTO = "Если требуется отправьте фотографии, если же фото не требуются нажмите 'Пропустить'"

PHOTO_INSTEAD_OF_TEXT = "Вы отправили фото вместо текста, пожалуйста, отправьте текст"

SUCCESSFUL_REPORT_CREATE = "Ваша жалоба отправлена в администрацию и в ближайшее время будет обработана"

ADMIN_MENU = "Добро пожаловать в администрационное меню, выберете интересуюшее вас действие"

REPORT_WORK_CHOICE = "Какой тип работы с жалобами вас интересует"

GET_SINGLE_REPORT_ID = "Введите айди жалобы с которой хотите работать"

WRONG_REPORT_ID = "Жалобы с таким ID не существует, попробуйте еще раз или вернитесь в главное меню"

REPORT_HIRE = "Хотите взять жалобу в работу?"

SUCCESSFULLY_HIRE = ("Жалоба взята в работу и прикрепленна к вам, когда вы решите проблему, "
                     "снова введите айди данной жалобы "
                     "в 'Работа с жалобами'")

ANOTHER_ADMIN_HIRING_OR_REJECT = "Другой администратор уже взял эту жалобу в работу либо отклонил"

REPORT_SOLUTION = "Проблема озвученая в жалобе была решена?"

SUCCESSFULLY_SOLUTION = "Жалоба помечена как решенная"

ALREADY_SOLUTION_OR_REJECT = "Жалоба уже была обработана, либо была отклонена"

ALL_REPORTS_ACTION_CHOICE = "Выберете действие"

SUCCESSFULLY_GET_REPORT_ALL = "Вы успешно взяли жалобу, для дальнейшей работы с ней, зайдите в раздел работы по ID"

ALL_REPORTS_VIEWED = ("Вы просмотрели все жалобы, хотите начать смотреть заново?\n"
                      "Пока вы смотрели, могли появиться новые")

NO_NOT_HIRE_REPORT = "Похоже, в данный момент нет ни одной не взятой в работу жалобы"

CHOICE_REPORT_LIST = 'Выберете, какой список жалоб вас интересует'

REPORT_REJECT = "Жалоба отклонена"

OVERDUE_REPORT = "До просрочки данной анкеты осталось менее 12 часов"
