WELCOME_MESSAGE = "Добро пожаловать в Репорт Бота"

GET_PHONE_NUMBER = "Отправьте свой номер телефона, для регистрации в нашем боте"
WRONG_PHONE_NUMBER_FORMAT = "Вы неккоректно ввели номер телефона"
SUCCESSFUL_PHONE_REGISTRATION = "Вы успешно зарегестрировались"

MAIN_MENU = "Главное меню нашего бота"

REPORT_TEXT = "Пожалуйста, подробно опишите вашу пробему текстом"

REPORT_PHOTO = "Если требуется отправьте фотографии, если же фото не требуются нажмите 'Пропустить'"

PHOTO_INSTEAD_OF_TEXT = "Вы отправили фото вместо текста, пожалуйста, отправьте текст"

SUCCESSFUL_REPORT_CREATE = "Ваша жалоба отправлена в администрацию и в ближайшее время будет обработана"
